
// Створіть функцію, що об'єднує всі завдання з корзиною та яблуками.
// Результати виводьте в консоль, а не на екран. Результати кожного виклику бажано групувати.
// Декілька разів задайте змінній значення і викличте функцію.
// Приклад коду виклику функції, слідкуйте за консоллю:
// var a = 0;
// fun();
// a = 2;
// fun();
// a = 8;
// fun();
// a = 14;
// fun();

function fun (){
	console.groupCollapsed('Інформація про яблука в корзині:');

	if(!a){
		console.log('На жаль, корзина порожня.');
	}
	else{
		console.log('Корзина не порожня.');
	}
	if(a>=2&&a<=5){
		console.log('В корзині декілька яблук');
	}
	if((a%3===0||a%7===0)&&(a!==0)){
		console.log('Кількість яблук в корзині ділиться на 3 чи на 7.');
	}

	console.groupEnd();
}

let a = 0;
fun();
a = 2;
fun();
a = 8;
fun();
a = 14;
fun();